#include <iostream>
#include <Windows.h>
#include <conio.h>

using namespace std;

long long fact(long long n) {
	return (n == 1 || n == 0) ? 1 : fact(n - 1) * n; 
	// РѕР±С‡РёСЃР»СЋС”РјРѕ СЂРµРєСѓСЂСЃРёРІРЅРѕ С„Р°РєС‚РѕСЂС–Р°Р»
}

long long FindBinominal(int n, int k) {
	return fact(n) / (fact(k)*fact(n - k));
	//С„РѕСЂРјСѓР»Р° Р±С–РЅ. РєРѕРµС„.
}


int main() {
	SetConsoleOutputCP(1251); // РґР»СЏ СѓРєСЂР°С—РЅСЃСЊРєРѕС— РІ РєРѕРЅСЃРѕР»С–.
	// СЏРєС‰Рѕ РЅРµ РїСЂР°С†СЋС” Р·РјС–РЅРёС‚Рё РІ РЅР°Р»Р°С€С‚СѓРІР°РЅРЅСЏС… РєРѕРЅСЃРѕР»С– С€СЂРёС„С‚ РЅР° Lucida Console 
	int n, k;
	long long bc;
	cout << "Р’РІРµРґС–С‚СЊ N: "; cin >> n;
	cout << "Р’РІРµРґС–С‚СЊ Рљ: "; cin >> k;
	if (n < k) { // СЏРєС‰Рѕ n<k С‚Рѕ Р·РЅР°РјРµРЅРЅРёРє РїС–РґРµ РІ РјС–РЅСѓСЃ С– СЂРµРєСѓСЂСЃС–СЏ РЅРµ СЃРєС–РЅС‡РёС‚СЊСЃСЏ
		cout << "\nN РјР°С” Р±СѓС‚Рё Р±С–Р»СЊС€РёРј РЅС–Р¶ Рљ. Р—Р°РјС–РЅСЋС”РјРѕ..\n";
		bc= FindBinominal(k, n);
	}
	else bc = FindBinominal(n, k); // Р·Р°РјС–РЅСЋС”РјРѕ Р·РјС–РЅРЅС– С‰РѕР± РЅРµ Р±СѓР»Рѕ РїРµСЂРµРїРѕРІРЅРµРЅРЅСЏ СЃС‚РµРєСѓ
	cout << "РљРѕРµС„С–С†С–С”РЅС‚  = "<<bc<<endl; 
	cout << "РџСЂРѕСЃС‚С– РјРЅРѕР¶РЅРёРєРё: \n";
	while (bc % 2 == 0) { // Р”С–Р»РёРјРѕ РїРѕРєРё РѕСЃС‚Р°С‡Р° == 0
		cout << bc << endl; bc /= 2;
	}
	_getch();
	return 0;
}