#include <iostream>
#include <cmath>
#include <conio.h>
#include <Windows.h>

using namespace std;

int main() {
	SetConsoleOutputCP(1251);
	int N; //РєРѕР»РёС‡РµСЃС‚РІРѕ С‡РёСЃРµР» 
	cout << "Р’РІРµРґРёС‚Рµ РєРѕР»РёС‡РµСЃС‚РІРѕ С‡РёСЃРµР»: " << endl;
	cin >> N;//РІРІРѕРґРёРј РєРѕР»РёС‡РµСЃС‚РІРѕ С‡РёСЃРµР»
	double i;
	double sum_pow_b = 0, sum_pow_a = 0, sum_sqrt_b = 0, sum_sqrt_a = 0;//РѕР±СЉСЏРІР»РµРЅРёРµ РїРµСЂРµРјРµРЅРЅС‹С… 
	while (N > 0) {//РЅР°С‡Р°Р»Рѕ С†РёРєР»Р°
		cout << "Р’РІРµРґРёС‚Рµ С‡РёСЃР»Рѕ: ";
		cin >> i;//РІРІРѕРґРёРј С‡РёСЃР»Рѕ
		if (i < 0) {//РµСЃР»Рё С‡РёСЃР»Рѕ < 0
			sum_pow_b += i;//СЃСѓРјРјР° РёСЃС…РѕРґРЅС‹С… С‡РёСЃРµР» < 0
			sum_pow_a += pow(i, 2);//СЃСѓРјРјР° С‡РёСЃРµР» РІ РєРІР°РґСЂР°С‚Рµ
		}
		else {//РёРЅР°С‡Рµ
			sum_sqrt_b += i;//СЃСѓРјРјР° РёСЃС…РѕРґРЅС‹С… С‡РёСЃРµР» > 0
			sum_sqrt_a += sqrt(i);//СЃСѓРјРјР° РєРѕСЂРЅРµР№ С‡РёСЃРµР»
		}
		N--;//СЃС‡РµС‚С‡РёРє СѓРјРµРЅСЊС€Р°РµС‚СЃСЏ РґРѕ 0
	}
	cout << "РЎСѓРјРјР° РёСЃС…РѕРґРЅС‹С… С‡РёСЃРµР» ";
	if (sum_sqrt_b + sum_pow_b > sum_pow_a + sum_sqrt_a) //СЃСЂР°РІРЅРёРІР°РµРј СЃСѓРјРјСѓ РёСЃС…РѕРґРЅС‹С… С‡РёСЃРµР» СЃ РїРѕР»СѓС‡РµРЅРЅС‹С… С‡РёСЃРµР»
		cout << "Р±РѕР»СЊС€Рµ";
	else
		cout << "РјРµРЅСЊС€Рµ";
	cout << " С‡РµРј СЃСѓРјРјР° РїРѕР»СѓС‡РµРЅРЅС‹С… С‡РёСЃРµР»";
	_getch();
	return 0;
}