#include <iostream> 
#include <Windows.h>
#include <conio.h>

using namespace std;

int main() {
	SetConsoleOutputCP(1251);

	int A[100];//РјР°СЃСЃРёРІ 
	int N;//РєРѕР»РёС‡РµСЃС‚РІРѕ СЌР»РµРјРµРЅС‚РѕРІ РІ РјР°СЃСЃРёРІРµ
	int count = 0;//СЃС‡РµС‚С‡РёРє
	int number;//РЅРѕРјРµСЂ РїРµСЂРІРѕРіРѕ РѕС‚СЂРёС†Р°С‚РµР»СЊРЅРѕРіРѕ С‡РёСЃР»Р° 
	cin >> N;//РІРІРѕРґРёРј РєРѕР»РёС‡РµСЃС‚РІРѕ СЌР»РµРјРµРЅС‚РѕРІ РІ РјР°СЃСЃРёРІРµ
	for (int i = 0; i < N; i++) {//РІРІРѕРґРёРј СЌР»РµРјРµРЅС‚С‹ РјР°СЃСЃРёРІР°
		cin >> A[i];
	}
	for (int i = 0; i < N; i++) {//С†РёРєР» РґР»СЏ РїРѕРґСЃС‡РµС‚Р° РєРѕР»РёС‡РµСЃС‚РІР° РѕС‚СЂРёС†Р°С‚РµР»СЊРЅС‹С… С‡РёСЃРµР» СЃ РЅРµС‡РµС‚РЅС‹РјРё РёРЅРґРµРєСЃР°РјРё
		if (A[i] < 0 && i % 2 != 0) {
			count++;
		}
	}
	for (int i = 0; i < N; i++) {//С†РёРєР» РґР»СЏ РЅР°С…РѕР¶РґРµРЅРёСЏ РЅРѕРјРµСЂР° РїРµСЂРІРѕРіРѕ РѕС‚СЂРёС†Р°С‚РµР»СЊРЅРѕРіРѕ СЌР»РµРјРµРЅС‚Р°
		if (A[i] < 0) {
			number = i;
			break;
		}
	}

	//РјРµРЅСЏРµРј РјРµСЃС‚Р°РјРё РїРµСЂРІС‹Р№ Рё РїРѕСЃР»РµРґРЅРёР№ СЌР»РµРјРµРЅС‚С‹ РјР°СЃСЃРёРІР°
	int temp = A[0];
	A[0] = A[N - 1];
	A[N - 1] = temp;

	cout << "РљРѕР»РёС‡РµСЃС‚РІРѕ РѕС‚СЂРёС†Р°С‚РµР»СЊРЅС‹С… С‡РёСЃРµР» СЃ РЅРµС‡РµС‚РЅС‹РјРё РёРЅРґРµРєСЃР°РјРё: " << count << endl;
	cout << "РќРѕРјРµСЂ РїРµСЂРІРѕРіРѕ РѕС‚СЂРёС†Р°С‚РµР»СЊРЅРѕРіРѕ С‡РёСЃР»Р° : " << number << endl;
	for (int i = 0; i < N; i++) 
		cout << A[i] << " ";
	
	_getch();
	return 0;
}