#include <iostream>
#include <Windows.h>
#include <conio.h>

using namespace std;

int main() {
	SetConsoleOutputCP(1251);

	int A[100];//РјР°СЃСЃРёРІ РІСЃРµС… СЌР»РµРјРµРЅС‚РѕРІ
	int N;//РєРѕР»РёС‡РµСЃС‚РІРѕ СЌР»РµРјРµРЅС‚РѕРІ РјР°СЃСЃРёРІР°
	cout << "Р’РІРµРґРёС‚Рµ РєРѕР»РёС‡РµСЃС‚РІРѕ СЌР»РµРјРµРЅС‚РѕРІ РІ РјР°СЃСЃРёРІРµ: ";
	cin >> N;
	int sum = 0;//СЃСѓРјРјР° РѕС‚СЂРёС†Р°С‚РµР»СЊРЅС‹С… С‡РёСЃРµР»
	int count_zero = 0;//РєРѕР»РёС‡РµСЃС‚РІРѕ С‡РёСЃРµР» СЂР°РІРЅРѕ РЅСѓР»СЋ
	int count = 0;//РєРѕР»РёС‡РµСЃС‚РІРѕ РїРѕР»РѕР¶РёС‚РµР»СЊРЅС‹С… С‡РёСЃРµР»
	int SUM = 0;//СЃСѓРјРјР° РїРѕР»РѕР¶РёС‚РµР»СЊРЅС‹С… С‡РёСЃРµР»
	cout << "Р’РІРµРґРёС‚Рµ СЌР»РµРјРµРЅС‚С‹ РјР°СЃСЃРёРІР°: ";
	for (int i = 0; i < N; i++) {
		cin >> A[i];
	}
	for (int i = 0; i < N; i++) {
		if (A[i] < 0) {
			sum += A[i];//СЃСѓРјРјРёСЂСѓРµС‚ РѕС‚СЂРёС†Р°С‚РµР»СЊРЅС‹С… С‡РёСЃРµР»
		}
		else if (A[i] == 0) {
			count_zero++;//РїРѕРґСЃС‡РµС‚ РєРѕР»РёС‡РµСЃС‚РІР° С‡РёСЃРµР» = 0
		}
		else {
			count++;//РїРѕРґСЃС‡РµС‚ С‡РёСЃРµР» > 0 
			SUM += A[i];//СЃСѓРјРјР° С‡РёСЃРµР» > 0
		}
	}



	cout << "РЎСѓРјРјР° РІСЃРµС… РѕС‚СЂРёС†Р°С‚РµР»СЊРЅС‹С… СЌР»РµРјРµРЅС‚РѕРІ: " << sum << endl;
	cout << "РљРѕР»РёС‡РµСЃС‚РІРѕ С‡РёСЃРµР», СЂР°РІРЅС‹С… РЅСѓР»СЋ: " << count_zero << endl;
	cout << "Р’С‹С‡РёСЃР»РёС‚СЊ СЃСЂРµРґРЅРµРµ Р°СЂРёС„РјРµС‚РёС‡РµСЃРєРѕРµ С‚РѕР»СЊРєРѕ РїРѕР»РѕР¶РёС‚РµР»СЊРЅС‹С… С‡РёСЃРµР»: " << SUM / count << endl;
	int B[100];//РјР°СЃСЃРёРІ РґР»СЏ С‡РёСЃРµР» < СЃСЂРµРґРЅРµРіРѕ Р°СЂРёС„РјРµС‚РёС‡РµСЃРєРѕРіРѕ
	int count_a = 0;//РєРѕР»РёС‡РµСЃС‚РІРѕ С‡РёСЃРµР» < СЃСЂРµРґРЅРµРіРѕ Р°СЂРёС„РјРµС‚РёС‡РµСЃРєРѕРіРѕ
	for (int i = 0; i < N; i++) {
		if (A[i] < SUM / count) {
			count_a++;
		}
	}
	int j = 0;
	for (int i = 0; i < N; i++) {//РїРµСЂРµРїРёСЃС‹РІР°РµРј СЌР»РµРјРµРЅС‚С‹ < СЃСЂРµРґРЅРµРіРѕ Р°СЂРёС„РјРµС‚РёС‡РµСЃРєРѕРіРѕ РІ РЅРѕРІС‹Р№ РјР°СЃСЃРёРІ
		if (A[i] < SUM / count) {
			B[j] = A[i];
			j++;
		}
	}
	for (int j = 0; j < count_a; j++) {
		cout << B[j] << " ";
	}
	cout << endl;
	_getch();
	return 0;
}